app/views/user_templates/show_likes.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
  </tr>
   <% current_user.likes.each do |like| %>