app/views/user_templates/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 2]]
---
  </tr>
   <% @user.photos.each do |photo| %>