app/controllers/comments_controller.rb

  def create_row
    @comment = Comment.new

    @comment.photo_id = params.fetch("photo_id")
    @comment.body = params.fetch("body")
    @comment.user_id = params.fetch("user_id")

    if @comment.valid?
      @comment.save
---
INSERT INTO "comments" ("photo_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["photo_id", 10], ["body", "Testing commentary"], ["user_id", 2], ["created_at", 2018-03-16 04:58:28 UTC], ["updated_at", 2018-03-16 04:58:28 UTC]]