app/controllers/likes_controller.rb

  def index
    @likes = Like.all
---
SELECT "likes".* FROM "likes"

  def create_row
    @like = Like.new

    @like.user_id = params.fetch("user_id")
    @like.photo_id = params.fetch("photo_id")

    if @like.valid?
      @like.save
---
INSERT INTO "likes" ("user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["photo_id", 1], ["created_at", 2018-03-16 06:37:14 UTC], ["updated_at", 2018-03-16 06:37:14 UTC]]