app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params.fetch("id_to_display"))
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_row
    @photo = Photo.new

    @photo.caption = params.fetch("name")
    @photo.image = params.fetch("image")
    @photo.user_id = params.fetch("user_id")
    @photo.address = params.fetch("address")
    @photo.rent = params.fetch("rent")
    @photo.start_date = params.fetch("start_date")
    @photo.end_date = params.fetch("end_date")
    @photo.description = params.fetch("description")

    if @photo.valid?
      @photo.save
---
INSERT INTO "photos" ("caption", "image", "user_id", "created_at", "updated_at", "address", "rent", "start_date", "end_date", "description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit_form
    @photo = Photo.find(params.fetch("prefill_with_id"))
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

  def update_row
    @photo = Photo.find(params.fetch("id_to_modify"))

    @photo.caption = params.fetch("caption")
    @photo.image = params.fetch("image")
    @photo.user_id = params.fetch("user_id")
    @photo.address = params.fetch("address")
    @photo.rent = params.fetch("rent")
    @photo.start_date = params.fetch("start_date")
    @photo.end_date = params.fetch("end_date")
    @photo.description = params.fetch("description")

    if @photo.valid?
      @photo.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "photos" SET "address" = ?, "rent" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["address", "1333 S Wabash, Chicago, IL, 60605"], ["rent", 0.15e4], ["start_date", Fri, 01 Jun 2018], ["end_date", Wed, 15 Aug 2018], ["updated_at", 2018-03-16 16:16:35 UTC], ["id", 22]]